import { LegalNoticeList } from "./info-modal.styled";

export const infoModalText = (
  <>
    <p>
      כאן תוכלו למצוא בקלות את כל הסניפים שמכבדים כרטיסים נטענים של חבר, מבלי להזין פרטי התחברות!
    </p>
    <p>
      תהנו מאופציות חיפוש מתקדמות, סינונים, מיונים, ומאופציית "חיפוש חופשי" - שתאפשר לכם לחפש על כל
      השדות השונים! נסו לחפש "אבן גבירול", "המבורגר", "מחנאות", "ראשון לציון" ועוד!
    </p>
    <p>
      האתר משתמש במידע הציבורי של hvr.co.il כדי לתת לכם ממשק חיפוש נוח לכל הסניפים השונים שיש לחבר
      להציע.
    </p>
    <br />
    <p>מוכנים להנות מחיפוש נוח, אמין ומהיר? למה אתם מחכים?! סגרו את ההודעה והתחילו לחפש!</p>
  </>
);

export const legalNoticeModalText = (
  <LegalNoticeList>
    <li>hvr-search.vercel.app - להלן "האתר".</li>
    <li>האתר אינו מקושר באף אופן ל-hvr.co.il, עמותת "חבר" או באי כוח של עמותת "חבר".</li>
    <li>לאף אחד מהגופים המוזכרים בסעיף 2 אין שום קשר לאתר, או ידע על הנעשה באתר.</li>
    <li>האתר מנוהל ומתוחזק ע"י אדם פרטי, ואינו חלק מכל עסק או גוף עם מטרות רווח.</li>
    <li>האתר משתמש בAPI הציבורי של hvr.co.il וזאת לפי חוק זכות יוצרים סעיפים 19(ב), 21(א).</li>
  </LegalNoticeList>
);
